# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Brewfile - Setup do Jefferson (Jeff)
# Focado em: Full Stack Development (Node, Go, Java, Rust) & Infra (Terraform, DBs)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

tap "homebrew/bundle"
tap "homebrew/services"

# --- CORE UTILITIES & MODERN SHELL ---
brew "fish"           # Seu shell principal
brew "starship"       # Prompt customizado
brew "zoxide"         # O 'cd' inteligente
brew "fzf"            # Fuzzy finder para busca rápida
brew "bat"            # O 'cat' com syntax highlight
brew "eza"            # O 'ls' moderno com ícones
brew "btop"           # Monitor de sistema moderno
brew "htop"           # Monitor de sistema clássico
brew "tmux"           # Terminal multiplexer
brew "wget"           # Download via CLI
brew "ripgrep"        # Busca de texto ultra rápida (rg)
brew "coreutils"      # GNU core utilities para macOS

# --- LINGUAGENS & RUNTIMES (Seu Core) ---
brew "node"
brew "pnpm"
brew "fnm"            # Fast Node Manager
brew "deno"
brew "go"
brew "rust"           # Rust compiler & cargo
brew "openjdk@17"     # Java que você usa no JSP/Spring
brew "maven"          # Build tool para Java
brew "python@3.14"    # Versão mais recente
brew "python@3.11"    # Versão estável comum
brew "pyenv"          # Gerenciador de versões Python
brew "ruby"
brew "chruby"         # Gerenciador de versões Ruby
brew "ruby-install"

# --- INFRA, CLOUD & DATABASES ---
brew "terraform"      # IaC
brew "packer"         # Image builds
brew "turso"          # LibSQL (SQLite na edge)
brew "sqld"           # Server para SQLite
brew "sqlite"
brew "heroku"
brew "neonctl"        # CLI para Neon (Postgres)
brew "aiven-client"   # CLI para Aiven
brew "stripe"         # CLI para pagamentos

# --- DEVELOPMENT TOOLS ---
brew "gh"             # GitHub CLI
brew "git"
brew "git-flow"
brew "watchman"       # File watching do Facebook/React Native
brew "cocoapods"      # iOS Dev
brew "tesseract"      # OCR (Extração de texto)
brew "ffmpeg"         # Processamento de vídeo
brew "yt-dlp"         # Download de vídeos

# --- BUILD TOOLS & LIBS ---
brew "cmake"
brew "gcc"
brew "llvm"
brew "pkgconf"
brew "libtool"

# --- FUN & TERMINAL UI ---
brew "neofetch"
brew "macchina"
brew "cmatrix"
brew "gemini-cli"

# --- CASKS (UI APPS) ---
cask "wezterm"                # Seu emulador de terminal
cask "claude-code"            # IA no terminal
cask "kap"                    # Screen recorder leve
cask "android-file-transfer"  # Conectar Android no Mac