# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Brewfile - Setup Jefferson
# Focado em React, Node.js, React Native e IA no terminal/editor
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~



tap "homebrew/bundle"     # Instala pacotes a partir deste Brewfile com brew bundle
tap "homebrew/services"   # Gerencia serviços locais com brew services

# --- CORE UTILITIES & SHELL ---

brew "fish"        # Shell moderno e amigável
brew "starship"    # Prompt bonito e informativo para Git/Node/status
brew "zoxide"      # cd inteligente que aprende suas pastas mais usadas
brew "fzf"         # Busca interativa no terminal
brew "bat"         # Alternativa ao cat com syntax highlight
brew "eza"         # Alternativa moderna ao ls
brew "btop"        # Monitor de CPU/RAM/processos no terminal
brew "tmux"        # Sessões e painéis persistentes no terminal
brew "wget"        # Download de arquivos pelo terminal
brew "curl"        # Requisições HTTP/API pelo terminal
brew "ripgrep"     # Busca rápida dentro de arquivos; comando rg
brew "fd"          # Alternativa moderna ao find
brew "jq"          # Manipula e formata JSON no terminal
brew "tree"        # Mostra estrutura de pastas em árvore
brew "coreutils"   # Utilitários GNU úteis para scripts
brew "nano"        # Editor simples no terminal

# --- GIT / GITHUB ---

brew "git"              # Versionamento de código
brew "gh"               # GitHub CLI para PRs, issues, auth e repositórios
brew "git-flow-next"    # Git Flow moderno para feature/release/hotfix

# --- NODE / REACT / NEXT / TYPESCRIPT ---

brew "fnm"      # Gerenciador de versões do Node.js
brew "pnpm"     # Gerenciador de pacotes rápido e eficiente
brew "bun"      # Runtime/toolkit moderno para JS/TS

# --- REACT NATIVE ---

brew "watchman"       # Observador de arquivos usado pelo Metro/React Native
brew "cocoapods"      # Gerencia dependências iOS em projetos React Native

# --- IA PARA PROGRAMAÇÃO ---

brew "opencode"       # Agente de IA open source no terminal
# cask "codex"        # Agente de código da OpenAI no terminal; deixe comentado se não usar

# --- BUILD TOOLS BÁSICOS ---

# brew "cmake"      # Build de algumas dependências nativas
# brew "pkgconf"    # Localiza bibliotecas nativas durante instalação/build

# --- CONTAINERS ---

cask "orbstack"   # Docker/containers leve no macOS; usar bancos via Docker aqui

# --- APPS ---

cask "arc"                    # Navegador principal
cask "google-chrome"          # Navegador secundário/testes
cask "zed"                    # Editor de código leve e moderno
cask "visual-studio-code"     # Editor principal/backup
cask "orbstack"               # Docker/containers leve no macOS
cask "android-file-transfer"  # Transferência de arquivos Android/macOS

# --- APPS DE SUPORTE ---

cask "anydesk"                # Acesso remoto
cask "filezilla"              # Cliente FTP/SFTP
cask "logi-options+"          # Logitech Options+ para mouse/teclado
cask "paragon-ntfs"           # Leitura/escrita em discos NTFS no macOS

# --- AUDIO / VIDEO / VPN / NETWORK ---

cask "finetune"               # Controle de volume/equalizador por aplicativo
cask "obs"                    # Gravação e transmissão de tela
cask "nordvpn"                # VPN NordVPN
cask "wireguard"              # Cliente WireGuard VPN
cask "angry-ip-scanner"       # Scanner de IP/rede; cask deprecated no Homebrew
cask "vlc"                    # Reprodutor de vídeo e áudio